package com.university.controllers;

import javafx.fxml.FXML;
import javafx.scene.control.TextArea;

public class InformationController {
    @FXML
    private TextArea userGuideTextArea;

    private String text = "Базові Функції ПЗ: \n" +
            "\n" +
            "        1)Визначення вартості навчання - користувачу надаються 2 варіанти: Визначити університети з найменшою або ж найбільшою вартістю навчання. Для використання сервісу натистніть першу кнопку в таскбарі зправа.\n" +
            "        2)Пошук університету за містом та країною. Щоб використати сервіс натисніть на 2 кнопку на таскбарі зліва та введіть значення в поля.\n" +
            "        3)Сортування університетів за кількістю студентів в порядку спадання методом Шела - Щоб використати сервіс натисніть на 3 кнопку на таскбарі зправа.\n" +
            "        4)Знаходження університетів за напрямом навчання - користувач вводить абривіатуру напряму навчання, а результат виведеться в полі Operations result.Щоб використати сервіс натисніть на 4 кнопку на таскбарі зправа.\n" +
            "        5)Знаходження університетів за кількістю студентів, що в ньому навчаються - користувач вводить цілочисельні значення у поля для визначення діапазону пошуку, а результат виведеться в полі Operations result.Щоб використати сервіс натисніть на 5 кнопку на таскбарі зправа.\n" +
            "        6)Керування напрямами навчання - користувач вводить назву університету та напрям навчання у відповідні поля, надається вибір додати або ж вилучити напрям навчання від університету.Щоб використати сервіс натисніть на 4 кнопку на таскбарі зправа.\n" +
            "        7)Керування файлами - користувач може записати дані у файл, або ж навпаки зчитати дані з файлу.Щоб використати сервіс натисніть на 7 кнопку на таскбарі зправа та виберіть функцію, що підходить вам.";

    @FXML
    public void initialize() {
        userGuideTextArea.setText(
                text
        );
    }
}
